In [ ]:
!pip install ipython-sql
!pip install mysqlclient

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.34)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.3)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (71.0.4)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Using cached jedi-0.19.1-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Using cached jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
Installing collected packages: jedi
Successfully installed jedi-0.19.1
Collecting mysqlclient
  Downloading mysqlclient-2.2.4.tar.gz (90 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 90.4/90.4 kB 3.5 MB/s eta 0:00:00
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Preparing metadata (pyproject.toml) ... done
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (pyproject.toml) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.2.4-cp310-cp310-linux_x86_64.whl size=124743 sha256=92398a4704df2cad4ac3c0c04e2f3b38f33a282b02fd49dafdda09841a093eda
  Stored in directory: /root/.cache/pip/wheels/ac/96/ac/2a4d8cb58a4d95de1dffc3f8b0ea42e0e5b63ab97640edbda3
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.4

In [ ]:
%load_ext sql

In [ ]:
%sql mysql://badmstudent:badmstudent@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306

In [ ]:
%sql show databases

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
8 rows affected.

[('ch07_review',),
 ('information_schema',),
 ('mysql',),
 ('northwind',),
 ('performance_schema',),
 ('sales',),
 ('sys',),
 ('yelp_champaign',)]

In [ ]:
%sql
USE sales

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.

[]

In [ ]:
%%sql
SELECT *
FROM INVOICE;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
8 rows affected.

[(1001, 10014, datetime.datetime(2014, 1, 16, 0, 0)),
 (1002, 10011, datetime.datetime(2014, 1, 16, 1, 0)),
 (1003, 10012, datetime.datetime(2014, 1, 16, 1, 0)),
 (1004, 10011, datetime.datetime(2014, 1, 17, 0, 0)),
 (1005, 10018, datetime.datetime(2014, 1, 17, 1, 0)),
 (1006, 10014, datetime.datetime(2014, 1, 17, 2, 0)),
 (1007, 10015, datetime.datetime(2014, 1, 17, 2, 0)),
 (1008, 10011, datetime.datetime(2014, 1, 17, 2, 0))]

In [ ]:
%sql SHOW tables

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
9 rows affected.

[('C1',),
 ('C2',),
 ('C3',),
 ('CUSTOMER',),
 ('EMP',),
 ('INVOICE',),
 ('LINE',),
 ('PRODUCT',),
 ('VENDOR',)]

In [131]:
# 1. List all vendor information from the VENDOR table.

%%sql

SELECT *
FROM VENDOR;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
11 rows affected.

[(21225, 'Bryson, Inc.', 'Smithson', '615', '223-3234', 'TN', 'Y'),
 (21226, 'SuperLoo, Inc.', 'Flushing', '904', '215-8995', 'FL', 'N'),
 (21231, 'D&E Supply', 'Singh', '615', '228-3245', 'TN', 'Y'),
 (21344, 'Gomez Bros.', 'Ortega', '615', '889-2546', 'KY', 'N'),
 (22567, 'Dome Supply', 'Smith', '901', '678-1419', 'GA', 'N'),
 (23119, 'Randsets Ltd.', 'Anderson', '901', '678-3998', 'GA', 'Y'),
 (24004, 'Brackman Bros.', 'Browning', '615', '228-1410', 'TN', 'N'),
 (24288, 'ORDVA, Inc.', 'Hakford', '615', '898-1234', 'TN', 'Y'),
 (25443, 'B&K, Inc.', 'Smith', '904', '227-0093', 'FL', 'N'),
 (25501, 'Damal Supplies', 'Smythe', '615', '890-3529', 'TN', 'N'),
 (25595, 'Rubicon Systems', 'Orton', '904', '456-0092', 'FL', 'Y')]

In [132]:
# 2. List all customer names whose balance is greater than 0.

%%sql

SELECT
      CUS_FNAME,
      CUS_INITIAL,
      CUS_LNAME,
      CUS_BALANCE
FROM
    CUSTOMER
WHERE
     CUS_BALANCE > 0;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
5 rows affected.

[('Kathy', 'W', 'Smith', 345.86),
 ('Paul', 'F', 'Olowski', 536.75),
 ('James', 'G', 'Brown', 221.19),
 ('George', '', 'Williams', 768.93),
 ('Anne', 'G', 'Farriss', 216.55)]

In [133]:
# 3. List all customers who have 0 balance.

%%sql

SELECT *
FROM CUSTOMER
WHERE CUS_BALANCE = 0;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
5 rows affected.

[(10010, 'Ramas', 'Alfred', 'A', '615', '844-2573', 0.0),
 (10011, 'Dunne', 'Leona', 'K', '713', '894-1238', 0.0),
 (10014, 'Orlando', 'Myron', '', '615', '222-1672', 0.0),
 (10015, "O'Brian", 'Amy', 'B', '713', '442-3381', 0.0),
 (10019, 'Smith', 'Olette', 'K', '615', '297-3809', 0.0)]

In [134]:
# 4. List all the invoice dates that are generated by customer 10011.

%%sql

SELECT
      CUS_CODE, INV_DATE
FROM
    INVOICE
WHERE
     CUS_CODE = '10011';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
3 rows affected.

[(10011, datetime.datetime(2014, 1, 16, 1, 0)),
 (10011, datetime.datetime(2014, 1, 17, 0, 0)),
 (10011, datetime.datetime(2014, 1, 17, 2, 0))]

In [135]:
# 5. How many customers live in the area where the area code is 615?

%%sql

SELECT COUNT(*) AS NO_CUS_AREACODE_615
FROM CUSTOMER
WHERE CUS_AREACODE = '615';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[(7,)]

In [137]:
# 6. List all employees who were born after 1970.

%%sql

SELECT *
FROM EMP
WHERE YEAR(EMP_DOB) > 1970;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
5 rows affected.

[(103, 'Ms.', 'Jones', 'Anne', 'M', datetime.datetime(1974, 10, 16, 0, 0), datetime.datetime(1994, 8, 28, 0, 0), '615', '898-3456', 100),
 (104, 'Mr.', 'Lange', 'John', 'P', datetime.datetime(1971, 11, 8, 0, 0), datetime.datetime(1994, 10, 20, 0, 0), '901', '504-4430', 105),
 (105, 'Mr.', 'Williams', 'Robert', 'D', datetime.datetime(1975, 3, 14, 0, 0), datetime.datetime(1998, 11, 8, 0, 0), '615', '890-3220', None),
 (107, 'Mr.', 'Diante', 'Jorge', 'D', datetime.datetime(1974, 8, 21, 0, 0), datetime.datetime(1994, 7, 2, 0, 0), '615', '890-4567', 105),
 (115, 'Mrs.', 'Saranda', 'Hermine', 'R', datetime.datetime(1972, 7, 25, 0, 0), datetime.datetime(1993, 4, 23, 0, 0), '615', '324-5505', 105)]

In [138]:
# 7. List the employee whose first name is Rhett, and who does not have a middle initial?

%%sql

SELECT *
FROM EMP
WHERE EMP_FNAME = 'Rhett'
     AND EMP_INITIAL = ' ';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[(102, 'Mr.', 'VanDam', 'Rhett', '', datetime.datetime(1958, 11, 14, 0, 0), datetime.datetime(1990, 12, 20, 0, 0), '901', '675-8993', 100)]

In [139]:
# 8. Who is employee 111?

%%sql

SELECT *
FROM EMP
WHERE EMP_NUM = '111';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[(111, 'Mr.', 'Washington', 'Rupert', 'E', datetime.datetime(1966, 1, 3, 0, 0), datetime.datetime(1993, 6, 21, 0, 0), '615', '890-4925', 105)]

In [154]:
# 9. List all the employees who are born between 1960-01-01 and 1969-12-31, using logic operator BETWEEN AND.

%%sql

SELECT *
FROM EMP
WHERE YEAR(EMP_DOB)
     BETWEEN '1960'
     AND '1969';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
7 rows affected.

[(101, 'Ms.', 'Lewis', 'Rhonda', 'G', datetime.datetime(1965, 3, 19, 0, 0), datetime.datetime(1986, 4, 25, 0, 0), '615', '324-4472', 100),
 (106, 'Mrs.', 'Smith', 'Jeanine', 'K', datetime.datetime(1968, 2, 12, 0, 0), datetime.datetime(1989, 1, 5, 0, 0), '615', '324-7883', 105),
 (108, 'Mr.', 'Wiesenbach', 'Paul', 'R', datetime.datetime(1966, 2, 14, 0, 0), datetime.datetime(1992, 11, 18, 0, 0), '615', '897-4358', None),
 (109, 'Mr.', 'Smith', 'George', 'K', datetime.datetime(1961, 6, 18, 0, 0), datetime.datetime(1989, 4, 14, 0, 0), '901', '504-3339', 108),
 (111, 'Mr.', 'Washington', 'Rupert', 'E', datetime.datetime(1966, 1, 3, 0, 0), datetime.datetime(1993, 6, 21, 0, 0), '615', '890-4925', 105),
 (112, 'Mr.', 'Johnson', 'Edward', 'E', datetime.datetime(1961, 5, 14, 0, 0), datetime.datetime(1983, 12, 1, 0, 0), '615', '898-4387', 100),
 (116, 'Mr.', 'Smith', 'George', 'A', datetime.datetime(1965, 11, 8, 0, 0), datetime.datetime(1988, 12, 10, 0, 0), '615', '890-2984', 108)]

In [155]:
# 10. How many employees does Mr. Williams manage?

%%sql

SELECT COUNT(*) AS NO_EMP_WILLIAMS
FROM EMP
WHERE EMP_MGR IN (
     SELECT EMP_NUM
     FROM EMP
     WHERE EMP_LNAME = 'Williams'
     );

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[(6,)]

In [156]:
# 11. Which employees do not have a manager, i.e., his manager value is NULL?

%%sql

SELECT *
FROM EMP
WHERE EMP_MGR IS NULL;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
3 rows affected.

[(100, 'Mr.', 'Kolmycz', 'George', 'D', datetime.datetime(1945, 6, 15, 0, 0), datetime.datetime(1985, 3, 15, 0, 0), '615', '324-5456', None),
 (105, 'Mr.', 'Williams', 'Robert', 'D', datetime.datetime(1975, 3, 14, 0, 0), datetime.datetime(1998, 11, 8, 0, 0), '615', '890-3220', None),
 (108, 'Mr.', 'Wiesenbach', 'Paul', 'R', datetime.datetime(1966, 2, 14, 0, 0), datetime.datetime(1992, 11, 18, 0, 0), '615', '897-4358', None)]

In [165]:
# 12. How many male employees, and how many female employees are in this company?

%%sql

SELECT
      COUNT(CASE
                WHEN EMP_TITLE = 'Mr.' THEN 1
            END) AS MALE_EMP,
      COUNT(CASE
                WHEN EMP_TITLE = 'Mrs.'
                OR EMP_TITLE = 'Ms.' THEN 1
            END) AS FEMALE_EMP
FROM
    EMP;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[(10, 7)]

In [166]:
# 13.  How many vendors are located in the state of GA?

%%sql

SELECT COUNT(*) AS NO_VENDORS_GA
FROM VENDOR
WHERE V_STATE = 'GA';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[(2,)]

In [167]:
# 14 . You vaguely recall that the name of a vendor starts with the letter B.  Can you list all vendors whose name starts with the letter B?

%%sql

SELECT *
FROM VENDOR
WHERE V_NAME LIKE 'B%';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
3 rows affected.

[(21225, 'Bryson, Inc.', 'Smithson', '615', '223-3234', 'TN', 'Y'),
 (24004, 'Brackman Bros.', 'Browning', '615', '228-1410', 'TN', 'N'),
 (25443, 'B&K, Inc.', 'Smith', '904', '227-0093', 'FL', 'N')]

In [168]:
# 15. List all vendors who are located in either GA or FL. (use logic operator IN)

%%sql

SELECT *
FROM VENDOR
WHERE V_STATE IN ('GA', 'FL');

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
5 rows affected.

[(21226, 'SuperLoo, Inc.', 'Flushing', '904', '215-8995', 'FL', 'N'),
 (22567, 'Dome Supply', 'Smith', '901', '678-1419', 'GA', 'N'),
 (23119, 'Randsets Ltd.', 'Anderson', '901', '678-3998', 'GA', 'Y'),
 (25443, 'B&K, Inc.', 'Smith', '904', '227-0093', 'FL', 'N'),
 (25595, 'Rubicon Systems', 'Orton', '904', '456-0092', 'FL', 'Y')]

In [169]:
# 16. Select all the products in which the product description contains the word ‘saw’ .

%%sql

SELECT *
FROM PRODUCT
WHERE P_DESCRIPT LIKE '%saw%';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
5 rows affected.

[('13-Q2/P2', '7.25-in. pwr. saw blade', datetime.datetime(2013, 12, 13, 0, 0), 32, 15, Decimal('14.99'), Decimal('0.05'), 21344),
 ('14-Q1/L3', '9.00-in. pwr. saw blade', datetime.datetime(2013, 11, 13, 0, 0), 18, 12, Decimal('17.49'), Decimal('0.00'), 21344),
 ('2232/QTY', 'B&D jigsaw, 12-in. blade', datetime.datetime(2013, 12, 30, 0, 0), 8, 5, Decimal('109.92'), Decimal('0.05'), 24288),
 ('2232/QWE', 'B&D jigsaw, 8-in. blade', datetime.datetime(2013, 12, 24, 0, 0), 6, 5, Decimal('99.87'), Decimal('0.05'), 24288),
 ('89-WRE-Q', 'Hicut chain saw, 16 in.', datetime.datetime(2014, 2, 7, 0, 0), 11, 5, Decimal('256.99'), Decimal('0.05'), 24288)]

In [170]:
# 17. From the product table, list the description of the type of hammer that doesn’t have a vendor?

%%sql

SELECT P_DESCRIPT
FROM PRODUCT
WHERE P_DESCRIPT LIKE '%hammer%'
    AND V_CODE IS NULL;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[('Sledge hammer, 12 lb.',)]

In [172]:
# 18. List the names of the vendors that supply screws?
%%sql

SELECT V_NAME
FROM VENDOR
WHERE V_CODE IN (
     SELECT V_CODE
     FROM PRODUCT
     WHERE P_DESCRIPT LIKE '%screw%'
     );

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
2 rows affected.

[('Bryson, Inc.',), ('D&E Supply',)]